u =
  .error = ❗️ Ошибочка, попробуйте позже
  .no-words-in-coll = ❗️ В коллекции нет слов

  .words-trainer = 🧠 Тренажер слов
  .homework = ✍️ Домашнее задание
  .edu-materials = 📚 Учебные материалы
  .settings = ⚙️ Настройки
  .change-lang = Сменить язык
  .edit-name = Редактировать имя
  .msg-settings =
    <b>{u.settings}</b>
    
    Язык: <i>Русский</i>
    Имя: <i>{$name}</i>
  .send-new-name = ✏️ Отправьте новое имя
  .invalid-name = ❗️ Некорректно введено имя
  .msg-homework = <b>{u.homework}:</b>
  .msg-homework-last-update = 📝 Последнее обновление: <i>{$datetime}</i>
  .msg-no-study-group = ❗️ Вы не находитесь в какой-либо учебной группе. Свяжитесь с администратором
  .msg-no-homework = 📗 Домашнее задание отсутствует
  .msg-words-trainer =
    <b>{u.words-trainer}</b>

  .revise-words = 🔄 Повторять слова
  .all-words = 💬 Все слова
  .words-collections = 📚 Коллекции слов
  .msg-words-collections = <b>{u.words-collections}</b>
  .ready-collections = 📝 Готовые коллекции
  .msg-ready-collections = <b>{u.ready-collections}</b>
  .msg-ready-collection =
    <b>{u.ready-collections}</b>
    Выбрано: <i>{$name}</i>
    Слов в коллекции: <i>{$wordsCount}</i>

    Нажми на слово, чтобы добавить его

  .collection-added = ✅ Коллекция добавлена

btn =
  .main-menu = Выберите нужный раздел
  .add-whole-collection = Добавить всю коллекцию
  .back = ⏪ Назад
  .to-main-menu = ⏪ В главное меню
  