u =
  .error = ❗️ Ошибочка, попробуйте позже
  .no-words-in-coll = ❗️ В коллекции нет слов
  .no-collections = ❗️ У Вас нет ни одной коллекции слов. Создайте её и попробуйте добавить слово снова
  .error-group-not-found = ❗️ Группа не найдена
  .error-collection-not-found = ❗️ Коллекция не найдена

  .words-trainer = 🧠 Тренажер слов
  .homework = ✍️ Домашнее задание
  .edu-materials = 📚 Учебные материалы
  .settings = ⚙️ Настройки
  .change-lang = Сменить язык
  .edit-name = Редактировать имя
  .msg-settings =
    <b>{u.settings}</b>

    Язык: <i>Русский</i>
    Имя: <i>{$name}</i>
  .send-new-name = ✏️ Отправьте новое имя
  .invalid-name = ❗️ Некорректно введено имя
  .msg-homework = <b>{u.homework}:</b>
  .msg-homework-last-update = 📝 Последнее обновление: <i>{$datetime}</i>
  .msg-no-study-group = ❗️ Вы не находитесь в какой-либо учебной группе. Свяжитесь с администратором
  .msg-no-homework = 📗 Домашнее задание отсутствует
  .msg-words-trainer =
    <b>{u.words-trainer}</b>

  .revise-words = 🔄 Повторять слова
  .search-words = 🔎 Поиск своих слов
  .add-word = 💬 Добавить слово
  .words-collections = 📘 Коллекции слов
  .msg-words-collections = <b>{u.words-collections}</b>
  .ready-collections = 📝 Готовые коллекции
  .msg-ready-collections = <b>{u.ready-collections}</b>
  .msg-ready-collection =
    <b>{u.ready-collections}</b>
    Выбрано: <i>{$name}</i>
    Слов в коллекции: <i>{$wordsCount}</i>

    Нажми на слово, чтобы добавить его
  .msg-ready-collection-word =
    <b>{u.ready-collections}</b>
    Выбрана коллекция: <i>{$collectionName}</i>
    Выбрано слово: <i>{$word}</i>
    Подсказка: <i>{$hint}</i>

    Выберите свою коллекцию для добавления слова
  .msg-ready-collection-word-added = ✅ Слово добавлено
  .collection-added = ✅ Коллекция добавлена
  .shared-collection-added = ✅ Коллекция <b>{$name}</b> добавлена
  .send-new-collection-name = ✏️ Отправьте имя для новой коллекции
  .invalid-new-collection-name = ❗️ Некорректно введено имя
  .collection-created = ✅ Коллекция создана
  .send-collection-new-name = ✏️ Отправьте новое имя для коллекции
  .collection-edited = ✅ Коллекция отредактирована

  .msg-collection =
    <b>{u.words-collections}</b>
    Выбрана коллекция: <i>{$name}</i>
    Слов в коллекции: <i>{$wordsCount}</i>
  .delete-collection-confirm =
    ❗️ Удаление коллекции <b>{$name}</b>
    Слов в коллекции: <b>{$wordsCount}</b>

    Восстановление после удаления невозможно
  .deleted-collection = ✅ Коллекция успешно удалена

  .msg-collection-word-list = <b>{btn.collection-words-list}</b>
  .msg-collection-word =
    Слово: <i>{$word}</i>
    Коллекция: <i>{$collectionName}</i>
    Подсказка: <i>{$hint}</i>

    Кол-во повторов слова: <i>{$repeatedCount}</i>

  .msg-joined-study-group = ✅ Вы успешно вступили в учебную группу <b>{$name}</b>

  .msg-add-words = 
    <b>{u.add-word}</b>

    Выберите коллекцию, в которой хотите создать слово

  .msg-send-word = 
    <b>{u.add-word}</b>

    Отправьте сообщение в следующем формате:

    Слово или фраза
    -
    Подсказка
    -
    Ссылка на фото (не обязательно)
  .msg-invalid-word = ❗️ Некорректно введено слово
  .msg-invalid-hint = ❗️ Некорректно введена подсказка
  .msg-invalid-photo = ❗️ Некорректно введено фото
  .msg-added-word = ✅ Слово <b>{$word}</b> успешно добавлено
  .msg-search-word = 🔎 Введите слово или фразу для поиска 
  .msg-nothing-found =
    ❗️ Поиск не дал результата
    
    Введите другое слово или фразу для поиска

  .msg-search-result = 🔍 Результат поиска:
  .msg-edu-materials = <b>{u.edu-materials}</b>
  
  .select-from-btns-below = ❗️ Выберите кнопку из списка ниже
  .delete-word-confirm =
    ❗️ Удаление слова <b>{$word}</b>

    Восстановление после удаления невозможно
  .deleted-word = ✅ Слово успешно удалено
  .set-repeat-whole-collection = ✔️ Все слова коллекции были включены в повторение
  .set-dont-repeat-whole-collection = ✖️ Все слова коллекции были исключены из повторения

btn =
  .main-menu = Выберите нужный раздел
  .add-whole-collection = Добавить всю коллекцию
  .back = ⏪ Назад
  .cancel = 🚫 Отмена
  .to-main-menu = ⏪ В главное меню
  .to-words-list = ⏪ К списку слов
  .to-collection = ⏪ К коллекции
  .to-the-word = 🔗 К слову
  .to-the-ready-collection = ⏪ Обратно к коллекции
  .create-collection = ➕ Создать
  .collection-words-list = 📗 Список слов
  .delete = ❌ Удалить
  .delete-confirm = 🗑 Уверен
  .edit-collection = ✏️ Редактировать
  .textbooks = 📔 Учебники
  .cheat-sheets = 😼 Шпаргалки
  .dictionaries = 📝 Словари
  .tenses = ⏳ Времена
  .irr-verbs = Неправильные глаголы
  .prepositions-of-place = Предлоги места
  .prepositions-of-time = Предлоги времени
  .irr-nouns = Неправильные существительные
  .modal-verbs = Модальные глаголы
  .direct-inderect-speech = Прямая/косвенная речь
  .colors = Цвета

  .repeating = ✔️ Повторяется
  .not-repeating = ✖️ Не повторяется

  .repeat-whole-collection = ✔️ Повторять все слова
  .dont-repeat-whole-collection = ✖️ Не повторять все слова

  .share-collection = 🔗 Поделиться коллекцией

  